In [2]:
import pandas as pd

In [35]:
fruits = pd.Series({'apples': 3, 'bananas': 2, 'oranges': 1})
print("\nOriginal Series:\n")
fruits

Original Series:

apples     3
bananas    2
oranges    1
dtype: int64

In [36]:
fruits['pears'] = 4
print("After adding 'pears':\n")
fruits

After adding 'pears':

apples     3
bananas    2
oranges    1
pears      4
dtype: int64

In [37]:
data = {
    'name': ['John', 'Mary', 'Alex', 'Sara', 'David', 'Emma', 'Liam', 'Sophia', 'ivan', 'anu'],
    'age': [25, 32, 29, 41, 35, 27, 22, 31, 45, 38],
    'gender': ['M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F']
}

df = pd.DataFrame(data)
print("\nDataFrame:\n")
df

DataFrame:

     name  age gender
0    John   25      M
1    Mary   32      F
2    Alex   29      M
3    Sara   41      F
4   David   35      M
5    Emma   27      F
6    Liam   22      M
7  Sophia   31      F
8    ivan   45      M
9     anu   38      F

In [38]:
occupations = ['Programmer', 'Manager', 'Analyst', 'Programmer', 'Manager',
               'Analyst', 'Programmer', 'Manager', 'Analyst', 'Programmer']

df['occupation'] = occupations
print("\nDataFrame after adding 'occupation' column:\n")
df

DataFrame after adding 'occupation' column:

     name  age gender  occupation
0    John   25      M  Programmer
1    Mary   32      F     Manager
2    Alex   29      M     Analyst
3    Sara   41      F  Programmer
4   David   35      M     Manager
5    Emma   27      F     Analyst
6    Liam   22      M  Programmer
7  Sophia   31      F     Manager
8    ivan   45      M     Analyst
9     anu   38      F  Programmer

In [24]:
age_filter = df[df['age'] >= 30]
print(" age >= 30:\n")
age_filter

 age >= 30:

     name  age gender  occupation
1    Mary   32      F     Manager
3    Sara   41      F  Programmer
4   David   35      M     Manager
7  Sophia   31      F     Manager
8    ivan   45      M     Analyst
9     anu   38      F  Programmer

In [27]:
csv_file = "pandas_assignment_output.csv"
df.to_csv(csv_file, index=False)
print(f"\nDataFrame successfully written to '{csv_file}'")

DataFrame successfully written to 'pandas_assignment_output.csv'

In [29]:
read_df = pd.read_csv(csv_file)
print("\nContents of the CSV file:\n")
read_df

Contents of the CSV file:

     name  age gender  occupation
0    John   25      M  Programmer
1    Mary   32      F     Manager
2    Alex   29      M     Analyst
3    Sara   41      F  Programmer
4   David   35      M     Manager
5    Emma   27      F     Analyst
6    Liam   22      M  Programmer
7  Sophia   31      F     Manager
8    ivan   45      M     Analyst
9     anu   38      F  Programmer